# Homebrew formulas / casks
# 使い方: `cd ~/dotfiles/ansible && make brew` (ansible/Makefile の brew ターゲット経由で実行する)
# pkg ベースの cask は sudo プロンプトを出すため対話 TTY で実行すること

# --- CLI tools ---
brew "git"
brew "stow"
brew "fzf"
brew "ripgrep"
brew "colordiff"
brew "source-highlight"
brew "difftastic"
brew "jq"
brew "yq"
brew "direnv"
brew "watch"
brew "tree"
brew "jump"
brew "gpg"
brew "pinentry-mac"
brew "mise"
brew "docker-credential-helper"

# --- Editors / linters (vim 系) ---
brew "vim"
brew "neovim"
brew "yamllint"

# --- zsh plugins (pure zsh 構成) ---
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# --- GUI apps (cask) ---
cask "codex"
cask "ghostty"
cask "jordanbaird-ice"
cask "finicky"
cask "hammerspoon"
cask "iina"
cask "swiftbar"
cask "1password"
cask "firefox"
cask "slack"
cask "obsidian"
cask "zed"
cask "tableplus"
cask "postman"

# --- pkg ベースの cask ---
# インストール時に sudo プロンプトが出る
# インストール後に macOS の「プライバシーとセキュリティ」で追加許可が必要な場合あり
cask "karabiner-elements"
cask "google-japanese-ime"
cask "tailscale-app"
